<?php
/**
 * Created by PhpStorm.
 * User: diana
 * Date: 17-1-16
 * Time: 下午10:16
 */

return [
    // +----------------------------------------------------------------------
    // | 模板设置
    // +----------------------------------------------------------------------
    'template' => [
        // 开启模板布局功能
        'layout_on'    => true,
        // 指定布局文件
        'layout_name'  => 'layout/layout',
    ],

    // +----------------------------------------------------------------------
    // | 会话设置
    // +----------------------------------------------------------------------
    'session'                => [
        'id'             => '',
        // SESSION_ID的提交变量,解决flash上传跨域
        'var_session_id' => '',
        // SESSION 前缀
        'prefix'         => 'yx_adm_',
        // 驱动方式 支持redis memcache memcached
        'type'           => '',
        // 是否自动开启 SESSION
        'auto_start'     => true,
    ]
];
